/*---------------------------------------------------------------------------*/
/* DCLecho()                                                                 */
/*---------------------------------------------------------------------------*/
DCLecho: procedure expose (ostem)
  trace o
  prc = 0

  say "echo from DCLecho. "arg(1)""

return (prc)
/*---------------------------------------------------------------------------*/
/* DCLmemexist()                                                             */
/*   -- ddname                                                               */
/*   -- member                                                               */
/*---------------------------------------------------------------------------*/
DCLmemexist: procedure expose (ostem)
  trace o
  prc = 0

  if arg() < 2 then return 12

  ccmd = "DCJDDME "arg(1)"("arg(2)")"
  address tso (ccmd)
  prc = rc

return (prc)
/* eol ***********************************************************************/
